Repository: gitextensions/GitExtensionsDoc
Catalog: source/locale/*/LC_MESSAGES/integration.po
Languages: es, ja, ko, ru

source: Integration
es: Integración
ja: 統合 (integration)
ko: 통합
ru: Интеграция

source: During installation you can choose to install the Visual Studio plug-in and shell extensions.
es: Durante la instalación puedes elegir instalar el plugin de Visual Studio y las extensiones de shell.
ja: インストール中、Visual Studio プラグインやシェル拡張をインストールするかどうかを選択できます。
ko: 설치 중에 비주얼 스튜디오 플러그인 및 셸 확장을 설치하도록 선택할 수 있습니다.
ru: Во время установки вы можете установить плагин Visual Studio и расширения оболочки.

source: Visual Studio
ko: 비주얼 스튜디오

source: There are two options in the context menu on files:
es: Hay dos opciones en el menú contextual sobre los ficheros:
ja: ファイルのコンテキストメニューに 2 つの選択肢があります:
ko: 파일의 상황 메뉴에는 두 가지 옵션이 있습니다.
ru: В контекстном меню файлов есть две опции:

source: View the file history by choosing the ‘File history’ option.
es: Ver el histórico de ficheros seleccionando la opción "Histórico del fichero".
ja: 「ファイル履歴」オプションを選択することでファイル履歴を閲覧できます。
ko: '파일 기록' 옵션을 선택하여 파일 기록을 봅니다.
ru: Просмотрите историю файлов, выбрав 'История файлов'.

source: Reset the file changes to the last committed revision.
es: Restablece los cambios del archivo a la última revisión commit publicada.
ja: ファイルの変更を最終コミットのリビジョンへリセットします。
ko: 파일 변경 사항을 마지막으로 커미트 된 개정으로 리셋합니다.
ru: Сбросить изменения файла до последнего зафиксированного коммита.

source: A Git Extensions toolbar allows you to perform the most common actions.
es: Una barra de Git Extensions te permite realizar la mayor parte de las acciones.
ja: Git Extensions ツールバーは最もよく使用される操作を実行できるようにします。
ko: 깃 익스텐션 도구 막대로 가장 일반적인 작업을 수행할 수 있습니다.
ru: Панель инструментов Git Extensions позволяет вам выполнять самые распространенные действия.

source: Commit (branch)
ja: コミット (ブランチ)
ko: 커미트 (분기)
ru: Зафиксировать (ветка)

source: Browse
es: Explorar
ja: ブラウズ
ko: 탐색

source: Pull
ja: プル
ko: 풀
ru: Получить

source: Push
ja: プッシュ
ko: 푸시
ru: Получить

source: Stash changes
es: Cambios Stash
ja: 変更のスタッシュ
ko: 변경 사항 스태시
ru: Спрятать изменения

source: Settings
es: Preferencias
ja: 設定
ko: 설정
ru: Настройки

source: Almost all function can be started from the ``Git`` menu in Visual Studio.
es: La mayor parte de las funciones las puedes iniciar desde el menú 'Git' en Visual Studio
ja: ほぼすべての機能は、Visual Studio の「Git」メニューから起動できます。
ko: 거의 모든 기능은 비주얼 스튜디오의 "깃" 메뉴에서 시작할 수 있습니다.
ru: Почти все функции могут быть вызваны из меню ``Git`` в Visual Studio.

source: Windows Explorer
es: Explorador de WIndows
ja: Windows エクスプローラー
ko: 윈도우 탐색기
ru: Проводник Windows

source: The common commands can be started from Windows Explorer using the shell extensions. This option is only available when Shell Extensions are installed.
es: La mayor parte de los comandos se pueden iniciar desde el explorador de Windows usando las extensiones del Shell. Esta opción solo es accesible cuando las extensiones del Shell están instaladas.
ja: シェル拡張を使用して、Windows エクスプローラーから共通コマンドを起動できます。このオプションは、シェル拡張がインストールされている場合のみ利用できます。
ko: 일반적인 명령은 셸 확장을 사용하여 윈도우 탐색기에서 시작할 수 있습니다. 이 옵션은 셸 확장이 설치된 경우에만 사용할 수 있습니다.
ru: Общие команды могут быть вызваны из проводника Windows с использованием расширений оболочки. Эта опция доступна только при установленных расширениях оболочки.

source: You can even create or clone a repository in any non git folder.
es: Puedes crear o clonar un repositorio desde cualquier carpeta sin Git
ja: git 以外のフォルダーにリポジトリを作成したりクローンすることもできます。
ko: 깃이 아닌 폴더에 리포지토리를 생성하거나 복제 할 수 있습니다.
ru: Вы даже можете создать или клонировать репозиторий в любую папку, не относящуюся к git.
