Repository: gitextensions/GitExtensionsDoc
Catalog: source/locale/*/LC_MESSAGES/merge_conflicts.po
Languages: es, ja, ko, ru

source: Merge Conflicts
es: Mergear Conflictos
ja: マージ競合
ko: 병합 충돌
ru: Конфликты слияния

source: When merging branches or commits you can get merge conflicts. Git will try to resolve these, but some conflicts need to be resolved manually. Git Extensions will show warnings when there is a merge conflict.
es: Cuando unes ramas o commits puedes manejar conflictos. Git intentará resolverlos, pero algunos conflictos necesitan ser resueltos manualmente. Git Extensions puede mostrar advertencias cuando hay un conflicto de uniones.
ja: ブランチやコミットをマージする際に、マージ競合が発生することがあります。Git はこれらを解決しようとしますが、いくつかの競合は手動で解決する必要があります。Git Extensions は、マージ競合が発生したときに警告を表示します。
ko: 브랜치 또는 커미트를 병합 할 때 병합 충돌이 발생할 수 있습니다. 깃은 이러한 문제를 해결하려고 시도하지만 일부 충돌은 수동으로 해결해야 합니다. 깃 익스텐션은 병합 충돌이 있을 때 경고를 표시합니다.
ru: При слиянии веток или коммитов вы можете получить конфликты слияния. Git попытается разрешить их, но некоторые конфликты необходимо разрешить вручную. Git Extensions будет показывать предупреждения при конфликте слияния.

source: Handle merge conflicts
es: Manejar conflictos de unión
ja: マージ競合の処理
ko: 병합 충돌 처리
ru: Обработка конфликтов слияния

source: To solve merge conflicts just click on a warning or open the merge conflict dialog from the menu. A dialog will prompt showing all conflicts. You can solve a conflict by double-click on a filename.
es: Para manejar conflictos de unión, haz click en la advertencia o abre el cuadro de dialogo de conflictos de unión desde el menú. Un cuadro de dialogo te preguntará mostrando todos los conflictos. Puedes solucionar el conflicto haciendo doble-click en un archivo.
ja: マージ競合を解決するには、警告をクリックするか、メニューからマージ競合ダイアログを開いてください。ダイアログが表示され、すべての競合が表示されます。ファイル名をダブルクリックすると、競合を解決できます。
ko: 병합 충돌을 해결하려면 경고를 클릭하거나 메뉴에서 병합 충돌 대화 상자를 엽니다. 모든 충돌을 보여주는 대화 상자가 나타납니다. 파일 이름을 두 번 클릭하여 충돌을 해결할 수 있습니다.
ru: Для разрешения конфликтов слияния, просто нажмите на предупреждение или откройте диалоговое окно конфликта слияния из меню. Появится диалоговое окно с указанием всех конфликтов. Вы можете решить конфликт, дважды щелкнув по имени файла.

source: There are three kinds of conflicts:
es: Hay tres tipos de conflictos:
ja: 競合には 3 種類あります:
ko: 세 종류의 충돌이 있습니다:
ru: Существует три вида конфликтов:

source: File deleted and changed
es: Archivo borrado y cambiado
ja: ファイル削除と変更
ko: 파일 삭제 및 변경
ru: Файл удален и изменен

source: Use modified or deleted file?
es: ¿Usar archivo modificado o borrado?
ja: ファイル変更と削除のどちらを使用するか?
ko: 수정 또는 삭제된 파일을 사용합니까?
ru: Применить изменение или удалить файл?

source: File deleted and created
es: Archivo borrado y creado
ja: ファイル削除と作成
ko: 파일 삭제 및 생성
ru: Файл удален и создан

source: Use created or deleted file?
es: ¿Usar archivo creado o borrado?
ja: ファイル作成と削除のどちらを使用するか?
ko: 생성 또는 삭제된 파일을 사용합니까?
ru: Применить создание или удалить файл?

source: File changed both locally and remotely
es: Archivo cambiado localmente y remotamente
ja: ファイルをローカルとリモートの両方で変更
ko: 로컬 및 원격으로 파일 변경
ru: Файл изменен локально и во внешнем

source: Start merge tool.
es: Iniciar herramienta de unión.
ja: マージツールを開始します。
ko: 병합 도구를 시작합니다.
ru: Запустить инструмент слияния.

source: If the file is deleted in one commit and changed in another commit, a dialog will ask to keep the modified file or delete the file. When there is a conflicting change the merge tool will be started. You can configure the tool you want to use for merge conflicts. The image below shows Perforce P4Merge a free to use merge tool. Git Extensions is packaged with KDiff3, an open source merge tool.
es: Si un archivo se ha borrado en un commit y se ha cambiado en otro commit, un cuadro de dialogo pregunta si mantiene el archivo modificado o borra el archivo. Cuando hay conflictos en los cambios la herramienta de unión se inicializa. Puedes configurar la herramientas que quieres usar para manejar conflictos de unión. La imagen de abajo muestra la herramienta de Perforce P4Merge, gratuita. Git Extensions esta empaquetado con KDiff3, una herramienta open source.
ja: あるコミットでファイルが削除され、別のコミットで変更された場合、変更されたファイルを残すか、ファイルを削除するかを尋ねるダイアログが表示されます。競合する変更がある場合、マージツールが開始されます。マージ競合に使用するツールを設定できます。下の画像は Perforce P4Merge であり無料で使えるマージツールです。Git Extensions には、オープンソースのマージツールである KDiff3 が同梱されています。
ko: 파일이 한 커미트에서 삭제되고 다른 커미트에서 변경되면 대화 상자는 수정된 파일을 유지하거나 파일을 삭제하라고 요구합니다. 변경 사항에 충돌이 있으면 병합 도구가 시작됩니다. 병합 충돌에 사용할 도구를 구성 할 수 있습니다. 아래 이미지는 무료 병합 도구인 Perforce P4Merge를 보여줍니다. 깃 익스텐션은 오픈 소스 병합 도구인 KDiff3와 함께 패키지되어 있습니다.
ru: Если файл был удален в одном коммите и изменен в другом коммите, диалоговое окно предложит сохранить измененный файл или удалить его. При наличии противоречивых изменений запускается инструмент слияния. Вы можете настроить инструмент, который вы хотите использовать для конфликтов слияния. На изображении ниже показан Perforce P4Merge - бесплатный инструмент для слияния. Git Extensions поставляется с KDiff3, инструментом слияния с открытым исходным кодом.

source: In the merge tool you will see four versions of the same file:
es: En la herramienta de unión puedes ver cuatro versiones del mismo fichero:
ja: マージツールには、同じファイルの 4 つのバージョンが表示されます:
ko: 병합 도구에서 동일한 파일의 네 가지 버전을 볼 수 있습니다:
ru: В инструменте слияния вы увидите четыре версии одного и того же файла:

source: Base
ja: ベース
ko: 베이스

source: The latest version of the file that exist in both repositories
es: La última versión del archivo que existe en ambos repositorios
ja: 両方のリポジトリに存在するファイルの最新版
ko: 두 리포지토리에 있는 파일의 최신 버전
ru: Последняя версия файла, которая существует в обоих репозиториях

source: Local
ja: ローカル
ko: 로컬

source: The latest local version of the file
es: La última versión local del fichero
ja: ローカルにあるファイルの最新版
ko: 파일의 최신 로컬 버전
ru: Последняя локальная версия файла

source: Remote
es: Remoto
ja: リモート
ko: 원격

source: The latest remote version of the file
es: La última versión remota del fichero
ja: リモートにあるファイルの最新版
ko: 파일의 최신 원격 버전
ru: Последняя внешняя версия файла

source: Merged
es: Unido
ja: マージ済
ko: 병합됨

source: The result of the merge
es: El resultado del merge
ja: マージの結果
ko: 병합의 결과
ru: Результат слияния

source: When you are in the middle of a merge the file named local represents your file. When you are in the middle of a rebase the file named remote represents your file. This can be confusing, so double check if you are in doubt.
es: Cuando estas en mitad de una unión el nombre del archivo local representa tu archivo. Cuando estas en mitad de un rebase el nombre del archivo remoto representa tu archivo. Esto puede generar confusión, verifica muy bien si tienes dudas.
ja: マージの途中には、ローカルという名前のファイルがあなたのファイル (your file) を表します。リベースの途中には、リモートという名前のファイルがあなたのファイル (your file) を表します。これは混乱する可能性があるので、疑問がある場合は再確認してください。
ko: 병합 중에 로컬이라는 파일이 파일을 나타냅니다. 리베이스 중에 원격이라는 파일이 파일을 나타냅니다. 이는 혼란스러울 수 있으므로 확실하지 않은 경우 다시 확인하도록 합니다.
ru: Когда вы находитесь в середине слияния, файл с именем local представляет ваш файл. Когда вы находитесь в середине перебазирования, файл с именем remote представляет ваш файл. Это может сбить с толку, так что дважды проверьте, если у вас есть сомнения.
