Repository: gitextensions/GitExtensionsDoc
Catalog: source/locale/*/LC_MESSAGES/plugins.po
Languages: es, ja, ko, ru

source: Plugins
ja: プラグイン
ko: 플러그인
ru: Плагины

source: List of the available plugins
es: Lista de plugins disponibles
ja: 利用できるプラグインの一覧
ko: 사용 가능한 플러그인 목록
ru: Список доступных плагинов

source: Auto Compile Submodules
es: Compilar automáticamente Submódulos
ja: サブモジュールの自動コンパイル
ko: 하위 모듈 자동 컴파일
ru: Автоматически компилировать субмодули

source: Background Fetch
es: Fetch en segundo plano.
ja: バックグラウンドフェッチ
ko: 백그라운드 페치
ru: Периодически забирать в фоне

source: Create Local Tracking Branches
es: Crear seguimiento de ramas locales
ja: ローカル追跡ブランチの作成
ko: 로컬 추적 브랜치 생성
ru: Создать локально отслеживающие ветки

source: Delete Unused Branches
es: Borrar ramas sin uso
ja: 未使用ブランチの削除
ko: 사용하지 않는 브랜치 삭제
ru: Удалить устаревшие ветки

source: Find Large Files
es: Buscar archivos grandes
ja: 大きいファイルを検索
ko: 대용령 파일 찾기
ru: Найти большие файлы

source: Gerrit Code Review
es: Revisión del código Gerrit
ja: Gerrit コードレビュー
ko: 게릿 코드 컴토
ru: Code Review используя Gerrit

source: GitFlow
ko: 깃 플로우

source: Github
ko: 깃허브

source: Proxy Switcher
ja: プロキシ切り替え
ko: 프록시 스위처
ru: Переключение Proxy

source: Release Notes Generator
es: Generador de Notas de Publicación
ja: リリースノート生成
ko: 릴리즈 노트 생성기
ru: Генератор Release Notes

source: Statistics
es: Estadísticas
ja: 統計
ko: 통계
ru: Статистика

source: This plugin permit to manage your _branching model: http://nvie.com/posts/a-successful-git-branching-model/ with _GitFlow: https://github.com/nvie/gitflow in GitExtension
es: Este plugin te permite mantener tu modelo _branching : http://nvie.com/posts/a-successful-git-branching-model/ con _GitFlow: https://github.com/nvie/gitflow en GitExtension
ja: このプラグインは GitExtensions で _GitFlow: https://github.com/nvie/gitflow で _ブランチモデル: http://nvie.com/posts/a-successful-git-branching-model/ を管理できるようにします。
ko: 이 플러그인을 사용하면 _branching 모델을 관리 할 수 ​​있습니다: http://nvie.com/posts/a-successful-git-branching-model/ with _GitFlow : https://github.com/nvie/gitflow in GitExtension
ru: Этот плагин позволяет управлять вашей _разветвленной моделью: http://nvie.com/posts/a-successful-git-branching-model/ с _GitFlow: https://github.com/nvie/gitflow в GitExtension

source: You should have GitFlow installed to use this plugin.
es: Tienes que tener GitFlow para usar este plugin
ja: このプラグインを使用するには、GitFlow をインストールする必要があります。
ko: 이 플러그인을 사용하려면 깃플로우가 설치되어 있어야 합니다.
ru: Вы должны установить GitFlow, чтобы использовать этот плагин.

source: The GitFlow plugin permit to : - init gitflow in your git repository - create your feature, hotfix, release or support branch - manage (pull, publish or finish) your existing gitflow branches
es: El plugin GitFlow te permite: - Iniciar gitflow en tu repositorio git - Crear tus características, hotfix, publicaciones o porte en la rama - Controlar (pull, publicar o finalizar) tu rama gitflow existente
ja: GitFlow プラグインは、以下ができるようにします: - git リポジトリに gitflow を導入 - feature、hotfix、release、support の各ブランチを作成 - 既存の gitflow ブランチを管理 (プル、公開 (publish)、完了 (finish))
ko: 깃플로우 플러그인은 다음을 허용합니다: - 깃 리포지토리에서 깃플로우 초기화 - 기능, 핫픽스, 릴리스 또는 지원 브랜치 생성 - 기존 깃플로우 분기 관리 (풀, 게시 또는 완료)
ru: Плагин GitFlow позволяет: - инициировать gitflow в вашем репозитории git - создавать ветки фич, исправлений, релизов или сервисные - управлять (получать, отправлять или завершать) вашими существующими gitflow ветками

source: GitUIPluginInterfaces
ja: Git UI プラグインインターフェイス
