Repository: gitextensions/GitExtensionsDoc
Catalog: source/locale/*/LC_MESSAGES/submodules.po
Languages: de, es, ja, ko

source: Submodules
de: Untermodule
es: Submódulos
ja: サブモジュール
ko: 하위 모듈

source: Large projects can be split into smaller parts using submodules. A submodule contains the name, url and revision of another repository. To create a submodule in an existing git repository you need to add a link to another repository containing the files of the submodule.
de: Große Projekte könnten mit Hilfe von Untermodulen in kleinere Teile aufgesplittet werden. Ein Untermodul enthält den Namen, die URL und die Revision eines anderen Repository. Um ein Untermodul in einem existierenden Git Repository anzulegen, müssen sie einen Verweis auf ein anderes Repository mit den Dateien des Untermoduls anlegen.
es: Los proyectos grandes se pueden partir en pequeñas partes usando submódulos. Un submódulo contiene el nombre, URL y revisión de otro repositorio. Para crear un submódulo en un repositorio git ya existente, necesitas añadir un enlace a otro repositorio que contiene los ficheros del submódulo.
ja: 大規模なプロジェクトは、サブモジュールを使って小さなパーツに分割できます。サブモジュールには、別のリポジトリの名前、URL、リビジョンが含まれています。既存の git リポジトリにサブモジュールを作成するには、サブモジュールのファイルを含む別のリポジトリへのリンクを追加する必要があります。
ko: 대형 프로젝트는 하위 모듈을 사용하여 더 작은 부분으로 분할 할 수 있습니다. 하위 모듈에는 다른 리포지토리의 이름, URL 및 개정이 포함됩니다. 기존 깃 리포지토리에 하위 모듈을 생성하려면 하위 모듈의 파일을 포함하는 다른 리포지토리에 대한 링크를 추가해야합니다.

source: Manage submodules
de: Untermodule verwalten
es: Gestionar submódulos
ja: サブモジュールを管理
ko: 하위 모듈 관리

source: The current state of the submodules can be viewed with the ``Manage submodules`` function. All submodules are shown in the list on the left.
de: Den aktuellen Status des Untermoduls können Sie einsehen über die Funktion ``Untermodule verwalten``. Alle Untermodule werden in der Liste auf der linken Seite angezeigt.
es: El estado actual de los submódulos se puede visualizar en la función "Administrar submódulos". Todos los submódulos se muestran en la lista de la izquierda.
ja: サブモジュールの現在の状態は「サブモジュールを管理」機能で確認できます。すべてのサブモジュールは左の一覧に表示されます。
ko: 하위 모듈의 현재 상태는 "하위 모듈 관리" 기능으로 볼 수 있습니다. 모든 하위 모듈이 왼쪽 목록에 표시됩니다.

source: Add submodule
de: Untermodul hinzufügen
es: Añadir submódulo
ja: サブモジュールを追加
ko: 하위 모듈 추가

source: Add a new submodule to the repository
de: Ein neues Untermodul zum Repository hinzufügen
es: Añadir un nuevo submódulo al repositorio
ja: リポジトリに新しいサブモジュールを追加します
ko: 리포지토리에 새로운 하위 모듈 추가

source: Synchronize
de: Synchronisieren
es: Sincronizar
ja: 同期
ko: 동기화

source: Synchronizes the remote URL configuration setting to the value specified in ``.gitmodules`` for the selected submodule.
de: Synchronisiert die Remote URL Konfiguration mit den Werten die in der ``.gitmodules`` für das ausgewählte Untermodul angegeben sind.
es: Sincroniza la configuración de la URL remota al valor especificado en``.gitmodules`` para el submódulo seleccionado.
ja: 選択したサブモジュールのリモート URL の構成を ``.gitmodules`` で指定した値に同期させます。
ko: 선택한 하위 모듈에 대해 원격 URL 구성 설정을 ".gitmodules"에 지정된 값으로 동기화합니다.

source: Initialize
de: Initialisieren
es: Inicializar
ja: 初期化
ko: 초기화

source: Initialize the selected submodules, i.e. register each submodule name and url found in ``.gitmodules`` into ``.git/config``. The submodule will also be updated.
de: Initialisiert die ausgewählten Untermodule, z. B. Registrierung aller Namen der Untermodule und URLs die in ``.gitmodules`` gefunden werden in der ``.git/config``. Die Untermodule werden ebenfalls aktualisiert.
es: Inicializa el submódulo seleccionado, por ejemplo, registra cada nombre de submódulo y URL encontrada en ``.gitmodules`` hacia ``.git/config``. El submódulo también se actualizará
ja: 選択したサブモジュールを初期化します。つまり、``.gitmodules`` で見つかった各サブモジュール名と URL を ``.git/config`` に登録します。また、サブモジュールも更新されます。
ko: 선택한 하위 모듈을 초기화합니다. 즉, ".gitmodules"에 있는 각 하위 모듈 이름과 URL을 ".git / config"에 등록합니다. 하위 모듈도 업데이트됩니다.

source: Update
de: Updaten
es: Actualizar
ja: 更新
ko: 업데이트

source: Update the registered submodules, i.e. clone missing submodules and checkout the commit specified in the index of the containing repository.
de: Aktualisiert die registrierten Untermodule, z. B. durch Klonen von fehlenden Untermodulen und dem Checkout des angegeben Commits im Indes aus dem angegeben Repository.
es: Actualiza los submódulos registrados, por ejemplo, clona los submódulos faltantes y verifica el commit especificado en la raíz del contenido del repositorio.
ja: 登録されているサブモジュールを更新、すなわち、欠落しているサブモジュールをクローンし、含まれているリポジトリのインデックスで指定されているコミットをチェックアウトします。
ko: 등록된 하위 모듈을 업데이트합니다. 즉, 누락된 하위 모듈을 복제하고 포함된 리포지토리의 색인에 지정된 커미트를 체크아웃합니다.

source: To add a new submodule choose ``Add submodule`` in the ``Manage submodules`` dialog.
de: Um ein neues Untermodul hinzuzufügen wählen Sie ``Untermodul hinzufügen`` im ``Untermodule verwalten`` Dialog.
es: Para añadir nuevos submódulos elige 'Añadir submódulo' en el dialogo 'Administrar submódulos'
ja: 新しいサブモジュールを追加するには、「サブモジュールを管理」ダイアログで「サブモジュールを追加」を選択します。
ko: 새 하위 모듈을 추가하려면 "하위 모듈 관리" 대화 상자에서 "하위 모듈 추가"를 선택하십시오.

source: Path to submodule
de: Pfad zum Untermodul
es: Ruta al submódulo.
ja: サブモジュールのパス
ko: 하위 모듈 경로

source: Path to the remote repository to use as submodule.
de: Pfad zum Remote Repository das als Untermodul verwendet wird
es: Ruta al repositorio remoto para usarlo como submódulo.
ja: サブモジュールとして使用するリモートリポジトリへのパス。
ko: 하위 모듈로 사용할 원격 리포지토리의 경로

source: Local path
de: Lokaler Pfad
es: Ruta local
ja: ローカルパス
ko: 로컬 경로

source: Local path to this submodule, relative to the root of the current repository.
de: Lokaler Pfad zu diesem Untermodul. Relativ zum Wurzelverzeichnis des aktuellen Repository.
es: Ruta local a este submódulo, relativo a la raíz del repositorio actual.
ja: このサブモジュールのローカルパス (現在のリポジトリのルートからの相対パス)。
ko: 현재 리포지토리의 루트에 상대적인 하위 모듈의 로컬 경로

source: Branch
es: Rama
ja: ブランチ
ko: 브랜치

source: Branch to track.
de: Branch der verfolgt werden soll
es: Rama a seguir.
ja: 追跡するブランチ。
ko: 추적할 브랜치

source: Remove submodule
de: Untermodul entfernen
es: Borrar submódulo
ja: サブモジュールを除去
ko: 하위 모듈 제거

source: It is currently not possible to remove a submodule using the Git Extensions user interface. To remove a submodule you need to manually:
de: Es ist aktuell nicht möglich ein Untermodul über die Git Extensions Benutzeroberfläche zu entfernen. Um ein Untermodul zu entfernen müssen Sie manuell:
es: No es posible borrar un submódulo usando la interfaz de Git Extensions. Para borrar un submódulo lo tienes que hacer manualmente.
ja: 現在、Git Extensions のユーザーインターフェイスではサブモジュールを除去できません。サブモジュールの除去は手動で行う必要があります:
ko: 현재 깃 익스텐션 사용자 인터페이스를 사용하여 하위 모듈을 제거 할 수 없습니다. 하위 모듈을 제거하려면 수동으로 다음을 수행해야 합니다.

source: Delete the relevant line from the ``.gitmodules`` file.
de: Löschen der relevanten Zeile aus der ``.gitmodules`` Datei.
es: Borra la línea relevante del archivo `.gitmodules``.
ja: ``.gitmodules`` ファイルから該当行を削除します。
ko: ".gitmodules" 파일에서 관련 행을 삭제합니다.

source: Delete the relevant section from ``.git/config``.
de: Löschen des relevanten Bereichs aus der ``.git/config``.
es: Borrar la sección relevante de ``.git/config``.
ja: ``.git/config`` から該当する節を削除します。
ko: "`.git/config"에서 관력 섹션을 삭제합니다.

source: Run ``git rm --cached path_to_submodule`` (no trailing slash).
de: Ausführen von ``git rm --cached Pfad_zum_Untermodul`` (keine abschließenden Slashes).
es: Ejecutar ``git rm --cached path_to_submodule`` (Sin comillas).
ja: ``git rm --cached サブモジュールへのパス`` (末尾にスラッシュをつけない)を実行します。
ko: "git rm --cached path_to_submodule"(슬래시 후행 없음)을 실행합니다.

source: Commit and delete the now untracked submodule files.
de: Committe und lösche die jetzt nicht mehr überwachten Dateien des Untermoduls.
es: Commit y borrar los archivos del submódulo sin seguimiento.
ja: 現時点で管理外のサブモジュールのファイルをコミットして削除します。
ko: 이제 추적되지 않은 하위 모듈 파일을 커미트하고 삭제합니다.
